const ap = new APlayer({
    container: document.getElementById('aplayer'), //播放器容器元素
    //mini: false, //迷你模式
    fixed: true, //吸顶模式
    autoplay: true, //自动播放
    //theme: '#FADFA3', //主题色
    //loop: 'all', //音频循环播放, 可选值: 'all'全部循环, 'one'单曲循环, 'none'不循环
    //order: 'random', //音频循环顺序, 可选值: 'list'列表循环, 'random'随机循环
    //preload: 'auto', //预加载，可选值: 'none', 'metadata', 'auto'
    //volume: 0.7, //默认音量，请注意播放器会记忆用户设置，用户手动设置音量后默认音量即失效
    //mutex: true, //互斥，阻止多个播放器同时播放，当前播放器播放时暂停其他播放器
    //listFolded: false, //列表默认折叠
    //listMaxHeight: 90, //列表最大高度
    //width: 210,
    
    audio: [ //音频信息,包含以下
        {
            name: '紫霞仙子（余轩Original Mix)', //音频名称
            artist: 'RT,余轩', //音频艺术家
            url: 'http://music.163.com/song/media/outer/url?id=555820893.mp3', //音频外链
            cover: 'http://p3.music.126.net/XZFM1XrG0C9fkIz2vrFt-Q==/109951163268930297.jpg', //音频封面
            lrc: '[00:00.000] 作曲 : RT[00:00.037] 作词 : RT[00:00.111]神仙也好妖怪也好[00:01.709]剑只有我跟我的意中人能够拔出[00:04.662]就算他是妖怪我也会一生一世的跟着他[00:08.116]如果不能跟我喜欢的人在一起的话[00:10.637]就算让我当玉皇大帝我也不会开心[00:13.165]一派胡言[00:14.149]既然你执迷不悟[00:15.405]我今天就要替天行道[00:16.965]要你在人界仙界消失[00:18.860]只见鸳鸯不见仙消失就消失[00:21.956]你再往前半步我就把你给杀了[00:23.941]看来我不应该来[00:26.349]你现在才知道太晚了[00:28.693]留下点回忆行不行[00:31.141]我不要回忆要的话留下你的人[00:34.662]这样只是得到我的肉体[00:36.340]并不能得到我的灵魂[00:38.309]我已经有爱人了[00:39.772]我们不会有结果[00:40.813]你让我走吧[00:42.373]好 我让你走[00:44.221]不过临走前你要亲我一下[00:49.517]我再怎么说也是个夕阳武士[00:51.772]你叫我亲我就亲[00:53.332]那我的形象不是全毁了[00:55.620]你说谎[00:57.469]你不敢亲我[00:58.829]因为你还喜欢我[00:59.877]如果这次你拒绝我的话[01:01.118]你会后悔一辈子的[01:40.828]哈哈哈哈哈哈[01:41.876]你居然相信那个小滑头[01:43.093]会回来接你[01:44.565]要是真的话[01:46.165]我可得恭喜你了[01:48.005]不过就算他回来[01:49.069]他有什么本事[01:50.981]把你从牛魔王[01:52.007]手上抢回去阿[01:53.860]上天既然安排[01:54.892]他能拔出我的紫青宝剑[01:57.436]他一定是一个不平凡的人[01:59.869]错不了[02:02.373]我知道有一天他会在一个[02:04.397]万众瞩目的情况下出现[02:05.181]身披金甲圣衣脚踏[02:08.300]七色云彩来娶我[02:10.036]呵~[02:11.525]你说的这不是神经病[02:13.303]这不是神经病[02:14.525]这是理想', //音频歌词，配合上面的lrcType使用
            theme: '#ebd0c2' //切换到此音频时的主题色，比上面的 theme 优先级高
        },
        {
            name: '英雄联盟之艾瑞莉娅篇', //音频名称
            artist: '宋瑞 / 圈妹 / 小可', //音频艺术家
            url: 'http://183.232.63.187/amobile.music.tc.qq.com/C400003rZdvH3HsIA3.m4a?guid=771361015&vkey=EF11861D1B8F31ACF18086AC7C0AD29EA9EDD0A2A8C3293A98C986A3418781420ECE66647021C2E40FBB9AC5965A33CB5F2238B4FC60625B&uin=0&fromtag=66', //音频外链
            cover: 'http://y.gtimg.cn/music/photo_new/T002R300x300M000000Nd78t4LPg26.jpg', //音频封面
            lrc: '英雄联盟之艾瑞莉娅篇', //音频歌词，配合上面的lrcType使用
            theme: '#ebd0c2' //切换到此音频时的主题色，比上面的 theme 优先级高
        },
        {
            name: '什么叫做一厢情愿', //音频名称
            artist: 'DJ Mr.Zi', //音频艺术家
            url: 'http://music.163.com/song/media/outer/url?id=546035454.mp3', //音频外链
            cover: 'http://p3.music.126.net/K24oGeF8GvgUX3cEWJjcTA==/109951163183923296.jpg', //音频封面
        },
        {
            name: '我告诉你什么事最可悲', //音频名称
            artist: 'Jones & Brock&RTRemix', //音频艺术家
            url: 'http://music.163.com/song/media/outer/url?id=550453774.mp3', //音频外链
            cover: 'http://p3.music.126.net/IHzG7x8x9-KpoScvpU2SNg==/109951163231260063.jpg', //音频封面
        },
        {
            name: 'Five Hours', //音频名称
            artist: 'Deorro', //音频艺术家
            url: 'http://music.163.com/song/media/outer/url?id=28263911.mp3', //音频外链
            cover: 'http://p3.music.126.net/SnUXxv_U8Dr3BRK4tCSeKQ==/109951164642751154.jpg', //音频封面
            lrc: 'Five Hours', //音频歌词，配合上面的lrcType使用
            theme: '#ebd0c2' //切换到此音频时的主题色，比上面的 theme 优先级高
        }
    ]
});